---
type: FieldDomainPointsByParameter
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 1
tags: [revit-api, class]
---

# FieldDomainPointsByParameter

`Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FieldDomainPointsByParameter | 2011 | `public FieldDomainPointsByParameter ( IList < double > points )` |